ERP.belugaerp/src/Catalogs/СоглашенияСКлиентами/СоглашенияСКлиентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СоглашенияСКлиентами</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>бг_ДляДолгосрочныхРезервов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_КлючевойКлиент</name>
    <type>
      <types>CatalogRef.бг_КлючевыеКлиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ПрименятьСкидкиПриТрансфертнойПродаже</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

ERP.belugaerp/src/Catalogs/СоглашенияСКлиентами/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	бг_ДобавитьЭлементыДоговора();
	бг_ДобавитьЭлементыКлючевойКлиент();
	бг_ДобавитьЭлементыДляДолгосрочныхРезервов();
	бг_ДобавитьЭлементыТрансфертныхПродаж();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура бг_ДобавитьЭлементыДоговора()
		
	бг_Договор = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_Договор",
		Элементы.ГруппаШапкаПраво,
		"Объект.бг_Договор");
	бг_Договор.АвтоМаксимальнаяШирина = Ложь;
	бг_Договор.МаксимальнаяШирина 	  = 28;
	
КонецПроцедуры

&НаСервере
Процедура бг_ДобавитьЭлементыКлючевойКлиент()
		
	бг_КлючевойКлиент = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_КлючевойКлиент",
		Элементы.ГруппаШапкаПраво,
		"Объект.бг_КлючевойКлиент");
	бг_КлючевойКлиент.АвтоМаксимальнаяШирина = Ложь;
	бг_КлючевойКлиент.МаксимальнаяШирина 	  = 28;
	
КонецПроцедуры

&НаСервере
Процедура бг_ДобавитьЭлементыДляДолгосрочныхРезервов()
	
	Если Не Объект.бг_ДляДолгосрочныхРезервов Тогда
		Возврат;
	КонецЕсли;
	
	бг_ДляДолгосрочныхРезервов = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_ДляДолгосрочныхРезервов",
		Элементы.ГруппаШапкаПраво,
		"Объект.бг_ДляДолгосрочныхРезервов",
		,
		,
		"ПолеФлажка"
		);
		
	бг_ДляДолгосрочныхРезервов.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
КонецПроцедуры

&НаСервере
Процедура бг_ДобавитьЭлементыТрансфертныхПродаж()
	
	бг_ПрименятьСкидкиПриТрансфертнойПродаже = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_ПрименятьСкидкиПриТрансфертнойПродаже",
		Элементы.ГруппаПрочиеУсловия,
		"Объект.бг_ПрименятьСкидкиПриТрансфертнойПродаже",
		,
		,
		"ПолеФлажка"
		);
		
	бг_ПрименятьСкидкиПриТрансфертнойПродаже.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
